name: "regime_prediction_model"
platform: "pytorch"
max_batch_size: 128
input [
  {
    name: "features"
    data_type: TYPE_FP32
    dims: [ 11 ]
  }
]
output [
  {
    name: "regime_prediction"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]
instance_group [
  {
    count: 1
    kind: KIND_GPU
    gpus: [ 0 ]
  }
]
dynamic_batching {
  max_queue_delay_microseconds: 100
}
